151 49845
1076 16
89 136
1055 41
68 108
1089 13
102 120
1068 141
81 138
1102 34
115 82
1047 61
1081 30
1060 66
73 104
1094 36
107 135
52 106
1073 27
86 118
120 132
1052 54
65 97
1086 5
99 90
44 19
1065 105
78 130
1099 23
112 91
1044 52
57 117
235 149
8220 126
1078 31
91 96
1057 48
70 134
769 148
1091 18
104 85
49 88
8212 29
1070 110
83 115
117 87
1049 70
1083 11
41 92
1062 60
75 147
1096 32
109 89
1041 56
54 111
1075 25
8217 81
88 139
33 43
122 143
1054 45
67 123
8230 49
1088 12
101 71
46 24
80 133
1067 140
1101 38
114 78
1046 79
59 122
1080 8
93 95
1025 144
1059 64
72 127
1093 33
106 151
51 101
1072 6
85 145
119 124
1051 58
1085 9
98 102
187 69
43 154
1064 76
77 119
1098 74
111 84
1043 50
56 114
1077 7
90 131
1056 59
69 107
1090 10
103 100
48 109
8211 47
1069 57
82 129
171 68
1103 22
116 86
1048 53
1082 15
40 93
1061 67
74 152
9601 4
1095 28
108 80
1040 51
53 112
1074 14
87 142
121 103
1053 37
66 128
1087 20
100 83
45 153
79 146
1100 21
113 137
1045 65
58 72
1079 26
1058 46
71 121
1092 42
105 77
50 99
228 150
1071 55
84 116
1105 98
118 94
63 39
1050 44
1084 17
97 73
42 63
1063 62
76 125
1097 35
110 75
1042 40
55 113
4 20 155
4 9 156
4 13 157
4 14 158
10 5 159
4 29 160
6 11 161
15 5 162
4 5 163
4 8 164
9 5 165
12 5 166
7 12 167
155 5 168
7 9 169
13 10 170
12 6 171
15 6 172
25 5 173
4 16 174
156 7 175
11 6 176
4 27 177
4 17 178
4 10 179
156 6 180
11 8 181
12 8 182
11 5 183
4 26 184
7 10 185
9 8 186
9 6 187
10 21 188
4 28 189
11 21 190
13 22 191
14 5 192
4 18 193
14 6 194
12 7 195
9 18 196
4 162 197
9 23 198
15 8 199
16 6 200
13 21 201
11 7 202
184 6 203
4 15 204
12 18 205
4 37 206
7 17 207
17 8 208
189 159 209
31 7 210
4 7 211
14 8 212
10 8 213
16 7 214
16 8 215
4 40 216
17 6 217
9 7 218
16 5 219
177 23 220
4 159 221
4 172 222
4 41 223
10 6 224
4 25 225
158 5 226
4 171 227
163 10 228
10 7 229
12 23 230
11 22 231
4 45 232
4 44 233
161 6 234
33 5 235
4 38 236
158 23 237
4 46 238
20 5 239
7 16 240
155 182 241
28 8 242
155 166 243
4 173 244
174 5 245
178 5 246
161 21 247
169 8 248
4 48 249
32 8 250
32 7 251
157 5 252
17 5 253
164 26 254
4 50 255
11 18 256
13 7 257
27 5 258
4 22 259
161 8 260
31 8 261
15 18 262
179 6 263
14 7 264
4 52 265
4 51 266
167 7 267
4 53 268
156 8 269
25 6 270
4 54 271
9 22 272
16 18 273
32 21 274
35 8 275
35 7 276
4 6 277
172 26 278
179 7 279
196 11 280
236 159 281
7 19 282
223 5 283
28 6 284
30 19 285
11 34 286
163 27 287
170 8 288
28 7 289
156 5 290
222 15 291
4 55 292
170 6 293
13 8 294
12 22 295
17 18 296
14 167 297
168 16 298
25 8 299
170 21 300
17 19 301
227 26 302
17 7 303
177 5 304
174 7 305
169 165 306
13 159 307
14 18 308
6 12 309
4 56 310
13 5 311
26 6 312
27 23 313
20 6 314
157 10 315
4 57 316
32 6 317
14 23 318
206 7 319
179 23 320
197 159 321
27 7 322
11 23 323
240 21 324
163 9 325
255 167 326
4 58 327
326 247 328
20 8 329
10 19 330
13 162 331
31 6 332
4 210 333
4 235 334
30 24 335
158 257 336
10 23 337
14 161 338
25 200 339
17 24 340
7 24 341
22 19 342
15 19 343
13 6 344
4 60 345
4 59 346
27 8 347
4 205 348
155 195 349
4 61 350
229 190 351
345 8 352
177 7 353
4 181 354
324 217 355
196 176 356
184 187 357
11 191 358
178 7 359
16 23 360
36 6 361
188 191 362
157 278 363
4 62 364
47 159 365
188 19 366
198 30 367
211 173 368
165 30 369
158 8 370
163 187 371
4 195 372
174 6 373
18 16 374
169 21 375
161 5 376
190 162 377
198 7 378
157 7 379
4 63 380
157 159 381
10 24 382
13 199 383
201 19 384
165 19 385
352 182 386
13 239 387
14 185 388
27 22 389
165 173 390
34 19 391
206 6 392
27 6 393
158 6 394
162 30 395
206 5 396
169 22 397
15 24 398
233 6 399
207 18 400
158 26 401
233 5 402
10 18 403
244 183 404
33 19 405
158 355 406
185 191 407
7 274 408
25 18 409
185 19 410
4 33 411
20 18 412
13 181 413
8 190 414
14 250 415
220 183 416
4 64 417
36 7 418
4 31 419
170 192 420
157 6 421
188 24 422
20 167 423
211 7 424
4 202 425
4 32 426
198 33 427
20 7 428
17 23 429
4 42 430
187 22 431
36 8 432
227 13 433
178 397 434
4 65 435
34 275 436
155 267 437
178 8 438
174 205 439
192 182 440
194 22 441
4 66 442
225 176 443
178 6 444
10 191 445
158 7 446
14 165 447
35 6 448
321 230 449
4 67 450
5 12 451
263 15 452
4 68 453
11 169 454
14 260 455
204 18 456
11 19 457
195 17 458
13 165 459
20 166 460
4 286 461
157 192 462
14 19 463
9 21 464
238 23 465
328 10 466
4 183 467
327 34 468
168 13 469
22 24 470
15 7 471
178 23 472
26 8 473
9 10 474
265 6 475
31 165 476
232 9 477
26 5 478
193 210 479
179 18 480
208 19 481
211 276 482
172 19 483
190 42 484
34 24 485
18 19 486
226 26 487
189 6 488
10 22 489
363 161 490
178 218 491
7 30 492
198 17 493
4 70 494
208 24 495
25 231 496
171 14 497
166 214 498
162 17 499
163 16 500
215 9 501
164 17 502
28 165 503
157 183 504
351 165 505
279 389 506
201 24 507
157 8 508
155 167 509
468 213 510
209 313 511
157 18 512
174 18 513
20 23 514
14 24 515
189 7 516
238 6 517
316 159 518
194 188 519
216 5 520
169 186 521
159 296 522
186 217 523
33 6 524
166 17 525
38 12 526
232 187 527
158 167 528
13 172 529
204 171 530
28 21 531
13 15 532
17 167 533
33 24 534
364 159 535
161 191 536
197 166 537
189 18 538
220 11 539
11 185 540
221 377 541
199 19 542
304 190 543
14 234 544
15 230 545
13 18 546
177 6 547
16 22 548
172 24 549
157 202 550
13 23 551
26 187 552
31 161 553
28 18 554
245 11 555
350 6 556
9 165 557
14 169 558
280 191 559
177 18 560
159 17 561
157 224 562
4 261 563
176 201 564
155 18 565
248 7 566
5 27 567
157 256 568
521 42 569
177 374 570
494 569 571
571 526 572
14 21 573
158 458 574
155 6 575
189 207 576
173 19 577
26 23 578
16 167 579
197 339 580
197 9 581
443 312 582
34 10 583
206 8 584
199 24 585
26 18 586
185 24 587
214 11 588
176 19 589
185 8 590
170 166 591
161 19 592
170 18 593
238 5 594
204 166 595
189 167 596
163 186 597
164 33 598
4 251 599
4 166 600
14 22 601
315 171 602
169 6 603
181 201 604
349 16 605
204 182 606
36 23 607
179 192 608
170 7 609
180 13 610
196 34 611
220 176 612
16 185 613
11 24 614
248 22 615
31 169 616
279 322 617
27 18 618
157 15 619
321 166 620
205 25 621
13 13 622
193 13 623
174 231 624
353 26 625
15 280 626
207 19 627
310 5 628
216 23 629
271 5 630
235 215 631
32 5 632
211 413 633
22 10 634
221 210 635
373 210 636
204 159 637
175 173 638
25 176 639
17 169 640
9 19 641
15 171 642
255 5 643
35 18 644
4 400 645
488 498 646
246 31 647
8 19 648
181 19 649
289 173 650
170 308 651
168 256 652
200 19 653
4 230 654
249 5 655
30 191 656
4 176 657
16 165 658
36 5 659
186 7 660
270 309 661
155 176 662
23 12 663
32 18 664
168 253 665
219 17 666
214 176 667
157 239 668
163 293 669
192 30 670
225 231 671
161 7 672
253 10 673
193 200 674
374 21 675
4 256 676
165 194 677
9 24 678
170 212 679
163 28 680
469 202 681
223 166 682
178 18 683
4 199 684
346 6 685
31 16 686
164 181 687
450 5 688
220 181 689
206 18 690
20 171 691
13 19 692
155 8 693
198 208 694
179 205 695
265 5 696
480 10 697
33 194 698
7 26 699
211 300 700
192 12 701
31 18 702
157 162 703
399 15 704
401 496 705
34 276 706
244 440 707
33 8 708
262 24 709
244 387 710
11 306 711
167 6 712
25 7 713
16 187 714
179 207 715
176 24 716
262 19 717
179 8 718
225 18 719
161 24 720
167 8 721
155 7 722
234 19 723
236 484 724
25 171 725
170 194 726
246 11 727
14 306 728
183 201 729
186 22 730
199 7 731
423 21 732
155 171 733
183 264 734
435 413 735
187 24 736
223 182 737
172 22 738
218 36 739
16 19 740
346 7 741
16 21 742
186 15 743
187 19 744
176 173 745
289 383 746
232 10 747
216 355 748
12 21 749
12 185 750
158 13 751
404 308 752
173 440 753
180 16 754
323 32 755
216 8 756
170 23 757
8 24 758
47 186 759
219 11 760
379 389 761
175 17 762
271 23 763
408 19 764
168 28 765
168 522 766
165 17 767
16 24 768
203 17 769
412 288 770
4 317 771
180 219 772
14 231 773
165 24 774
162 14 775
170 195 776
172 208 777
185 7 778
5 9 779
4 76 780
273 17 781
20 497 782
359 28 783
181 24 784
328 330 785
363 234 786
239 11 787
69 24 788
192 190 789
346 8 790
184 214 791
16 186 792
12 10 793
234 201 794
298 272 795
168 219 796
168 26 797
543 251 798
14 159 799
168 11 800
258 30 801
228 388 802
174 167 803
162 7 804
238 182 805
223 195 806
162 9 807
157 677 808
260 201 809
11 248 810
7 173 811
207 24 812
189 267 813
200 24 814
13 24 815
680 375 816
574 22 817
232 186 818
442 8 819
421 253 820
6 9 821
698 213 822
13 294 823
155 23 824
13 202 825
27 675 826
27 171 827
238 7 828
17 186 829
246 25 830
14 171 831
184 9 832
218 30 833
225 205 834
433 13 835
199 33 836
177 166 837
169 23 838
537 202 839
251 30 840
212 11 841
164 13 842
271 414 843
308 32 844
350 187 845
517 15 846
4 295 847
261 200 848
759 826 849
269 650 850
170 22 851
449 30 852
15 183 853
305 183 854
12 19 855
15 159 856
170 171 857
28 172 858
180 28 859
224 19 860
748 15 861
175 7 862
381 166 863
661 16 864
263 17 865
646 30 866
163 25 867
226 30 868
362 24 869
504 447 870
157 388 871
225 256 872
165 14 873
20 195 874
570 185 875
294 11 876
221 19 877
307 22 878
31 248 879
193 347 880
168 183 881
8 10 882
156 18 883
168 172 884
216 7 885
26 21 886
170 558 887
274 19 888
407 19 889
10 167 890
163 170 891
194 9 892
42 451 893
12 169 894
244 12 895
381 22 896
220 591 897
287 171 898
216 257 899
170 728 900
394 17 901
4 36 902
516 734 903
328 382 904
171 22 905
281 173 906
31 200 907
236 213 908
174 212 909
226 183 910
178 240 911
211 30 912
510 15 913
163 501 914
193 212 915
193 31 916
229 19 917
278 23 918
199 17 919
179 171 920
198 19 921
194 19 922
246 476 923
288 24 924
15 356 925
331 377 926
193 323 927
245 166 928
221 173 929
184 207 930
462 8 931
325 19 932
162 173 933
217 9 934
199 30 935
157 329 936
166 30 937
31 234 938
155 202 939
331 30 940
168 272 941
27 167 942
516 173 943
334 229 944
179 195 945
281 17 946
474 267 947
163 258 948
10 171 949
305 30 950
163 15 951
194 185 952
305 176 953
175 5 954
265 7 955
288 19 956
232 714 957
467 317 958
20 182 959
162 339 960
459 286 961
225 214 962
224 9 963
28 248 964
155 295 965
198 24 966
175 10 967
805 622 968
163 13 969
252 11 970
194 34 971
263 343 972
21 22 973
8 9 974
168 561 975
439 173 976
14 420 977
174 8 978
164 303 979
22 188 980
278 6 981
182 11 982
513 217 983
165 7 984
269 484 985
448 22 986
325 24 987
162 739 988
279 732 989
168 523 990
4 79 991
205 261 992
221 577 993
415 201 994
269 33 995
180 17 996
444 299 997
4 250 998
181 9 999
595 573 1000
813 26 1001
168 297 1002
358 19 1003
184 18 1004
157 20 1005
379 322 1006
386 19 1007
157 172 1008
224 24 1009
220 188 1010
568 284 1011
449 7 1012
423 6 1013
338 191 1014
12 24 1015
318 30 1016
25 663 1017
4 418 1018
246 409 1019
155 309 1020
436 33 1021
158 16 1022
304 202 1023
164 532 1024
802 8 1025
338 5 1026
168 799 1027
243 760 1028
157 414 1029
251 173 1030
419 169 1031
243 753 1032
334 183 1033
281 10 1034
287 7 1035
251 11 1036
676 28 1037
439 299 1038
171 19 1039
226 10 1040
927 27 1041
194 30 1042
157 167 1043
394 13 1044
159 14 1045
372 26 1046
31 273 1047
165 212 1048
293 212 1049
436 7 1050
268 26 1051
252 27 1052
292 12 1053
193 215 1054
205 34 1055
162 19 1056
203 15 1057
509 240 1058
225 171 1059
209 365 1060
26 22 1061
12 34 1062
206 486 1063
647 185 1064
262 34 1065
356 201 1066
10 182 1067
197 12 1068
8 26 1069
406 15 1070
166 16 1071
15 341 1072
13 207 1073
9 34 1074
414 42 1075
222 31 1076
239 16 1077
189 185 1078
243 307 1079
16 361 1080
425 25 1081
171 24 1082
254 47 1083
194 24 1084
168 781 1085
668 395 1086
197 17 1087
22 201 1088
260 19 1089
402 339 1090
159 30 1091
15 282 1092
206 1075 1093
226 11 1094
300 24 1095
206 410 1096
179 22 1097
315 195 1098
311 27 1099
28 161 1100
169 7 1101
186 361 1102
166 632 1103
710 501 1104
178 390 1105
171 26 1106
174 23 1107
213 14 1108
376 201 1109
157 460 1110
371 24 1111
204 195 1112
613 21 1113
386 24 1114
233 171 1115
265 8 1116
32 181 1117
279 27 1118
362 19 1119
762 390 1120
168 22 1121
10 186 1122
284 13 1123
225 166 1124
168 38 1125
9 16 1126
175 30 1127
27 166 1128
1022 621 1129
985 864 1130
305 192 1131
318 7 1132
7 190 1133
300 19 1134
174 171 1135
317 22 1136
14 240 1137
177 745 1138
28 385 1139
204 205 1140
791 201 1141
32 499 1142
348 172 1143
27 202 1144
13 256 1145
560 12 1146
28 159 1147
555 31 1148
579 261 1149
406 398 1150
354 659 1151
17 248 1152
436 30 1153
853 186 1154
283 522 1155
219 212 1156
17 22 1157
371 19 1158
174 267 1159
219 33 1160
179 182 1161
364 6 1162
530 961 1163
1031 275 1164
218 7 1165
196 188 1166
18 10 1167
242 224 1168
249 6 1169
819 181 1170
177 181 1171
233 159 1172
178 161 1173
216 414 1174
216 6 1175
182 9 1176
175 926 1177
157 212 1178
957 162 1179
183 24 1180
848 557 1181
379 30 1182
42 7 1183
183 19 1184
713 893 1185
158 170 1186
331 242 1187
28 169 1188
216 167 1189
563 26 1190
155 247 1191
4 12 1192
174 194 1193
358 24 1194
237 311 1195
1174 1185 1196
183 10 1197
18 12 1198
327 6 1199
271 6 1200
620 30 1201
266 9 1202
277 12 1203
357 391 1204
221 11 1205
226 166 1206
157 533 1207
177 202 1208
192 295 1209
9 418 1210
560 273 1211
510 398 1212
316 17 1213
550 273 1214
155 497 1215
360 19 1216
221 339 1217
33 18 1218
9 185 1219
20 295 1220
305 844 1221
204 230 1222
15 213 1223
180 988 1224
644 34 1225
184 5 1226
12 167 1227
32 306 1228
171 473 1229
214 181 1230
218 19 1231
352 474 1232
279 202 1233
10 195 1234
158 303 1235
191 19 1236
8 33 1237
797 192 1238
157 755 1239
950 679 1240
652 242 1241
320 19 1242
210 181 1243
179 167 1244
31 214 1245
181 1142 1246
311 17 1247
570 159 1248
449 33 1249
1013 159 1250
218 13 1251
185 21 1252
27 181 1253
4 540 1254
269 172 1255
221 296 1256
222 12 1257
13 186 1258
430 8 1259
691 212 1260
215 11 1261
214 30 1262
34 445 1263
158 523 1264
157 303 1265
25 19 1266
271 8 1267
337 30 1268
327 8 1269
4 276 1270
222 17 1271
234 24 1272
336 339 1273
196 19 1274
334 188 1275
157 240 1276
310 23 1277
221 12 1278
911 711 1279
332 188 1280
162 285 1281
406 343 1282
315 18 1283
36 18 1284
270 19 1285
4 34 1286
215 19 1287
30 15 1288
164 947 1289
263 395 1290
174 166 1291
158 176 1292
38 9 1293
168 30 1294
421 429 1295
166 14 1296
169 19 1297
42 8 1298
628 187 1299
158 191 1300
36 309 1301
245 293 1302
310 7 1303
166 634 1304
74 22 1305
555 173 1306
443 26 1307
769 590 1308
198 285 1309
336 173 1310
157 601 1311
158 185 1312
162 335 1313
18 17 1314
9 207 1315
287 23 1316
196 24 1317
179 166 1318
155 1227 1319
210 274 1320
807 242 1321
718 235 1322
620 173 1323
207 23 1324
333 176 1325
204 272 1326
268 17 1327
363 6 1328
200 12 1329
264 181 1330
163 278 1331
25 167 1332
269 960 1333
623 428 1334
446 181 1335
242 187 1336
965 253 1337
196 181 1338
331 190 1339
28 199 1340
264 170 1341
32 169 1342
192 183 1343
529 22 1344
271 218 1345
167 10 1346
157 667 1347
593 329 1348
235 548 1349
178 376 1350
195 215 1351
741 299 1352
194 186 1353
673 195 1354
186 17 1355
4 182 1356
271 7 1357
321 1055 1358
348 199 1359
157 297 1360
246 12 1361
251 19 1362
253 476 1363
475 19 1364
226 460 1365
354 274 1366
218 24 1367
32 176 1368
210 19 1369
510 343 1370
69 19 1371
13 183 1372
10 165 1373
594 377 1374
512 276 1375
198 282 1376
299 19 1377
331 173 1378
1023 7 1379
158 324 1380
177 267 1381
157 23 1382
202 30 1383
168 47 1384
10 297 1385
219 166 1386
347 171 1387
36 19 1388
383 33 1389
157 314 1390
500 187 1391
196 14 1392
415 33 1393
242 10 1394
188 39 1395
157 588 1396
683 31 1397
264 26 1398
547 9 1399
215 165 1400
461 258 1401
401 22 1402
6 19 1403
349 642 1404
8 17 1405
1032 11 1406
765 213 1407
671 548 1408
11 454 1409
415 7 1410
197 272 1411
238 8 1412
1170 20 1413
647 410 1414
162 515 1415
17 185 1416
171 586 1417
273 19 1418
593 20 1419
174 375 1420
20 202 1421
294 176 1422
318 33 1423
790 169 1424
197 173 1425
25 280 1426
502 1250 1427
215 10 1428
273 24 1429
193 25 1430
181 192 1431
165 300 1432
269 17 1433
402 166 1434
344 19 1435
727 28 1436
190 19 1437
354 258 1438
221 301 1439
25 24 1440
30 229 1441
213 19 1442
15 176 1443
28 207 1444
867 525 1445
249 471 1446
28 185 1447
7 33 1448
189 8 1449
26 9 1450
376 384 1451
191 24 1452
194 362 1453
221 10 1454
269 856 1455
344 24 1456
252 14 1457
327 5 1458
241 272 1459
178 25 1460
219 30 1461
305 14 1462
222 395 1463
252 297 1464
157 267 1465
350 5 1466
197 11 1467
567 276 1468
20 176 1469
32 231 1470
685 26 1471
290 531 1472
372 250 1473
258 12 1474
572 19 1475
159 503 1476
249 8 1477
954 1181 1478
415 30 1479
275 33 1480
12 590 1481
172 33 1482
217 19 1483
514 10 1484
176 384 1485
162 301 1486
190 478 1487
158 159 1488
337 7 1489
170 167 1490
157 822 1491
275 30 1492
1116 1288 1493
399 1017 1494
606 626 1495
270 24 1496
157 34 1497
207 5 1498
222 26 1499
283 28 1500
318 17 1501
361 24 1502
572 24 1503
209 19 1504
202 19 1505
157 1246 1506
727 284 1507
275 7 1508
163 314 1509
27 12 1510
178 22 1511
1118 342 1512
157 253 1513
360 24 1514
307 166 1515
28 5 1516
184 7 1517
336 33 1518
260 24 1519
359 1047 1520
174 308 1521
194 422 1522
28 234 1523
247 165 1524
214 274 1525
164 9 1526
283 16 1527
540 7 1528
306 30 1529
11 224 1530
370 215 1531
162 463 1532
233 166 1533
165 294 1534
186 8 1535
1301 21 1536
334 1103 1537
163 770 1538
178 165 1539
173 190 1540
538 1156 1541
782 231 1542
706 173 1543
630 31 1544
555 616 1545
175 258 1546
262 200 1547
538 14 1548
21 699 1549
164 387 1550
383 7 1551
157 176 1552
225 525 1553
283 38 1554
16 207 1555
5 10 1556
361 19 1557
1182 1123 1558
1083 312 1559
25 23 1560
16 161 1561
190 24 1562
192 7 1563
438 196 1564
12 275 1565
1162 498 1566
401 1160 1567
910 551 1568
227 258 1569
302 173 1570
183 17 1571
1240 505 1572
234 474 1573
249 224 1574
26 7 1575
186 172 1576
250 33 1577
200 188 1578
186 19 1579
383 30 1580
1093 661 1581
828 732 1582
765 400 1583
487 273 1584
198 301 1585
230 19 1586
406 172 1587
223 167 1588
183 261 1589
252 639 1590
334 554 1591
411 171 1592
163 250 1593
174 247 1594
20 161 1595
162 159 1596
574 248 1597
157 428 1598
14 257 1599
310 166 1600
197 218 1601
32 172 1602
155 183 1603
337 19 1604
27 182 1605
226 13 1606
847 666 1607
582 24 1608
34 201 1609
162 24 1610
181 187 1611
370 214 1612
500 165 1613
157 229 1614
223 6 1615
256 317 1616
246 640 1617
155 230 1618
175 219 1619
31 385 1620
182 6 1621
194 583 1622
520 10 1623
337 24 1624
294 181 1625
36 24 1626
9 367 1627
243 1069 1628
353 13 1629
31 566 1630
217 24 1631
839 14 1632
30 213 1633
226 1468 1634
246 183 1635
467 14 1636
254 1341 1637
178 169 1638
180 1154 1639
244 166 1640
502 306 1641
664 34 1642
1573 38 1643
233 1643 1644
175 264 1645
1131 28 1646
195 6 1647
186 24 1648
157 1168 1649
1024 286 1650
643 387 1651
168 554 1652
454 23 1653
197 183 1654
169 24 1655
411 194 1656
240 18 1657
195 19 1658
27 286 1659
445 19 1660
357 242 1661
1173 375 1662
257 11 1663
308 34 1664
200 749 1665
559 24 1666
446 201 1667
255 176 1668
35 21 1669
202 26 1670
31 260 1671
455 201 1672
186 607 1673
157 1417 1674
168 545 1675
338 19 1676
20 183 1677
186 341 1678
1413 314 1679
159 173 1680
168 890 1681
407 24 1682
192 26 1683
327 7 1684
16 272 1685
192 173 1686
1226 183 1687
824 224 1688
553 18 1689
333 19 1690
162 340 1691
193 297 1692
165 15 1693
175 13 1694
307 30 1695
559 19 1696
513 17 1697
193 322 1698
180 312 1699
157 213 1700
25 9 1701
430 451 1702
883 31 1703
6 24 1704
20 22 1705
170 264 1706
186 470 1707
430 6 1708
251 24 1709
321 905 1710
216 324 1711
197 202 1712
230 24 1713
316 30 1714
1202 409 1715
595 212 1716
157 545 1717
408 39 1718
27 295 1719
1566 30 1720
15 10 1721
843 194 1722
381 11 1723
180 578 1724
203 314 1725
32 165 1726
163 159 1727
441 201 1728
432 22 1729
203 313 1730
184 308 1731
438 183 1732
252 567 1733
33 280 1734
8 25 1735
970 200 1736
544 201 1737
203 275 1738
177 8 1739
1097 210 1740
1715 202 1741
182 176 1742
177 309 1743
259 19 1744
193 219 1745
192 166 1746
334 489 1747
194 366 1748
287 1305 1749
432 8 1750
192 886 1751
163 235 1752
47 224 1753
271 18 1754
180 239 1755
902 388 1756
13 34 1757
357 34 1758
719 313 1759
218 282 1760
175 18 1761
276 173 1762
170 165 1763
244 1209 1764
186 26 1765
348 262 1766
421 17 1767
684 14 1768
430 663 1769
237 496 1770
547 32 1771
504 194 1772
668 1099 1773
461 347 1774
164 307 1775
281 30 1776
215 24 1777
168 17 1778
287 8 1779
238 18 1780
1146 626 1781
163 12 1782
174 672 1783
187 342 1784
206 185 1785
623 303 1786
219 340 1787
73 71 1788
20 267 1789
215 188 1790
15 196 1791
500 390 1792
227 447 1793
297 8 1794
299 24 1795
1652 977 1796
445 24 1797
197 934 1798
691 250 1799
202 24 1800
192 17 1801
1148 187 1802
669 1048 1803
265 18 1804
213 11 1805
359 307 1806
287 22 1807
233 230 1808
238 207 1809
159 28 1810
13 344 1811
1500 400 1812
1493 857 1813
944 11 1814
795 11 1815
177 171 1816
370 16 1817
33 171 1818
195 26 1819
14 1030 1820
4 11 1821
229 24 1822
13 169 1823
1190 464 1824
491 19 1825
563 192 1826
223 18 1827
224 22 1828
4 332 1829
438 11 1830
31 186 1831
273 217 1832
25 183 1833
665 1669 1834
337 33 1835
426 18 1836
1086 165 1837
28 167 1838
1046 162 1839
293 19 1840
199 183 1841
475 210 1842
236 224 1843
217 1067 1844
1027 982 1845
158 776 1846
724 5 1847
179 295 1848
174 192 1849
10 12 1850
263 162 1851
243 1108 1852
263 804 1853
310 745 1854
246 639 1855
193 332 1856
271 309 1857
42 5 1858
293 773 1859
602 9 1860
752 19 1861
404 318 1862
183 30 1863
276 30 1864
831 213 1865
411 6 1866
14 247 1867
1302 1476 1868
1457 1073 1869
241 278 1870
568 242 1871
175 382 1872
177 240 1873
163 214 1874
194 182 1875
200 9 1876
15 231 1877
520 26 1878
1464 1228 1879
1085 161 1880
357 764 1881
263 301 1882
346 18 1883
1544 410 1884
270 22 1885
157 1351 1886
370 588 1887
243 489 1888
227 387 1889
219 301 1890
180 297 1891
13 262 1892
33 309 1893
456 200 1894
312 9 1895
42 6 1896
172 12 1897
364 167 1898
9 248 1899
13 385 1900
158 171 1901
331 7 1902
750 21 1903
25 172 1904
199 208 1905
1033 658 1906
806 714 1907
230 7 1908
439 25 1909
15 166 1910
274 191 1911
1043 1549 1912
174 999 1913
584 650 1914
353 478 1915
436 17 1916
32 199 1917
190 22 1918
25 356 1919
253 11 1920
168 192 1921
177 161 1922
1214 185 1923
1110 876 1924
220 366 1925
163 173 1926
404 192 1927
1907 552 1928
32 183 1929
1600 1841 1930
235 10 1931
274 24 1932
901 329 1933
289 420 1934
228 264 1935
17 49 1936
619 1751 1937
180 214 1938
409 24 1939
1053 20 1940
163 459 1941
359 284 1942
176 270 1943
23 19 1944
25 195 1945
192 19 1946
567 171 1947
1638 342 1948
295 16 1949
206 587 1950
283 561 1951
228 297 1952
7 14 1953
550 1904 1954
187 289 1955
255 8 1956
1548 651 1957
258 166 1958
1029 165 1959
250 30 1960
4 432 1961
159 301 1962
789 165 1963
280 24 1964
194 407 1965
233 18 1966
654 1536 1967
1446 1409 1968
305 191 1969
16 166 1970
14 454 1971
193 173 1972
15 621 1973
32 248 1974
180 26 1975
263 731 1976
536 19 1977
157 322 1978
323 30 1979
200 182 1980
681 16 1981
751 207 1982
9 169 1983
1028 553 1984
998 166 1985
976 30 1986
783 5 1987
752 24 1988
244 546 1989
350 214 1990
223 267 1991
514 224 1992
1554 522 1993
1213 1017 1994
442 247 1995
7 47 1996
1135 162 1997
225 8 1998
1235 609 1999
1080 188 2000
629 311 2001
620 7 2002
462 30 2003
423 8 2004
403 19 2005
221 17 2006
207 6 2007
16 169 2008
34 330 2009
310 6 2010
157 412 2011
1057 1611 2012
1054 212 2013
832 592 2014
411 18 2015
403 24 2016
284 10 2017
284 188 2018
176 507 2019
1786 33 2020
300 34 2021
175 959 2022
680 167 2023
408 24 2024
175 312 2025
27 169 2026
27 165 2027
503 24 2028
242 505 2029
34 384 2030
174 1621 2031
27 21 2032
930 286 2033
186 282 2034
31 5 2035
315 376 2036
180 32 2037
283 825 2038
28 375 2039
193 303 2040
31 486 2041
4 190 2042
35 169 2043
213 24 2044
408 191 2045
200 208 2046
567 631 2047
193 552 2048
537 231 2049
336 19 2050
392 219 2051
164 16 2052
168 235 2053
411 192 2054
461 215 2055
249 1616 2056
237 13 2057
298 1385 2058
466 39 2059
303 22 2060
530 13 2061
214 19 2062
193 186 2063
296 19 2064
1176 299 2065
217 22 2066
163 992 2067
673 182 2068
433 545 2069
462 34 2070
442 2065 2071
225 295 2072
158 293 2073
213 22 2074
246 1320 2075
251 7 2076
228 23 2077
628 190 2078
165 285 2079
167 19 2080
239 12 2081
274 39 2082
1753 199 2083
226 1599 2084
487 1363 2085
706 30 2086
538 188 2087
1085 234 2088
28 367 2089
23 195 2090
331 17 2091
15 195 2092
219 14 2093
35 248 2094
250 7 2095
706 7 2096
193 642 2097
31 615 2098
462 492 2099
9 213 2100
170 182 2101
250 17 2102
280 19 2103
14 202 2104
246 30 2105
9 432 2106
211 1243 2107
9 306 2108
203 235 2109
304 166 2110
409 19 2111
214 285 2112
230 26 2113
16 171 2114
1590 294 2115
203 162 2116
1203 208 2117
1025 11 2118
538 977 2119
249 949 2120
244 701 2121
619 182 2122
259 447 2123
197 313 2124
302 217 2125
174 264 2126
271 38 2127
25 205 2128
284 300 2129
188 43 2130
496 360 2131
166 194 2132
11 566 2133
272 11 2134
178 185 2135
284 22 2136
1196 36 2137
1681 22 2138
175 190 2139
435 173 2140
323 7 2141
10 43 2142
71 75 2143
184 1386 2144
349 1245 2145
1004 313 2146
198 340 2147
158 196 2148
428 11 2149
10 39 2150
173 30 2151
215 176 2152
190 229 2153
184 183 2154
215 229 2155
244 159 2156
1830 13 2157
178 167 2158
1299 12 2159
909 879 2160
237 787 2161
158 498 2162
164 19 2163
449 17 2164
1511 25 2165
359 170 2166
181 15 2167
186 342 2168
225 6 2169
20 234 2170
168 12 2171
872 258 2172
221 801 2173
637 365 2174
500 369 2175
348 393 2176
174 272 2177
265 231 2178
195 7 2179
8 208 2180
435 276 2181
157 264 2182
219 194 2183
249 159 2184
74 7 2185
1319 338 2186
1004 393 2187
222 731 2188
230 30 2189
594 339 2190
582 19 2191
353 387 2192
13 257 2193
20 356 2194
71 73 2195
1299 793 2196
243 213 2197
958 742 2198
163 591 2199
368 19 2200
1033 16 2201
346 5 2202
208 187 2203
172 481 2204
174 297 2205
402 218 2206
686 169 2207
607 19 2208
175 1596 2209
163 1515 2210
15 205 2211
842 289 2212
824 10 2213
249 492 2214
245 393 2215
381 190 2216
20 231 2217
302 264 2218
306 173 2219
227 215 2220
168 264 2221
1427 12 2222
1400 166 2223
254 1152 2224
1083 1077 2225
530 294 2226
338 24 2227
10 161 2228
249 162 2229
14 186 2230
36 169 2231
25 169 2232
296 24 2233
20 20 2234
12 248 2235
450 8 2236
266 12 2237
31 185 2238
1593 27 2239
183 212 2240
1397 242 2241
241 1253 2242
1112 20 2243
157 323 2244
168 793 2245
158 787 2246
726 24 2247
28 627 2248
603 19 2249
259 578 2250
536 24 2251
290 270 2252
528 165 2253
218 16 2254
415 656 2255
241 545 2256
180 533 2257
316 484 2258
435 7 2259
351 385 2260
13 428 2261
16 194 2262
14 1136 2263
188 7 2264
176 16 2265
174 701 2266
357 366 2267
264 190 2268
237 224 2269
165 335 2270
259 12 2271
170 19 2272
31 360 2273
181 384 2274
452 210 2275
1807 312 2276
307 17 2277
195 30 2278
1171 26 2279
155 634 2280
168 460 2281
356 384 2282
517 2254 2283
161 18 2284
328 224 2285
275 17 2286
1052 887 2287
837 876 2288
178 375 2289
442 6 2290
183 384 2291
172 17 2292
487 831 2293
32 186 2294
442 5 2295
372 2026 2296
34 382 2297
157 1799 2298
1093 864 2299
623 755 2300
271 397 2301
218 341 2302
193 16 2303
10 199 2304
169 18 2305
261 10 2306
9 167 2307
464 19 2308
15 182 2309
607 24 2310
163 26 2311
1339 262 2312
606 925 2313
695 666 2314
157 675 2315
190 586 2316
415 384 2317
346 23 2318
334 289 2319
207 191 2320
195 24 2321
246 22 2322
254 18 2323
222 804 2324
168 314 2325
337 17 2326
420 19 2327
429 13 2328
228 1757 2329
379 27 2330
459 24 2331
281 19 2332
225 182 2333
4 93 2334
242 337 2335
30 43 2336
34 986 2337
13 196 2338
237 171 2339
174 185 2340
790 212 2341
241 552 2342
462 258 2343
75 71 2344
423 240 2345
235 17 2346
528 8 2347
20 323 2348
733 212 2349
31 21 2350
171 212 2351
192 24 2352
28 262 2353
318 24 2354
579 332 2355
38 16 2356
665 1565 2357
1497 200 2358
304 12 2359
1304 385 2360
1238 181 2361
1052 900 2362
320 191 2363
8 12 2364
163 165 2365
173 17 2366
9 161 2367
180 18 2368
1553 162 2369
190 224 2370
215 12 2371
38 190 2372
168 1234 2373
155 22 2374
348 777 2375
9 400 2376
193 194 2377
178 171 2378
1293 218 2379
891 247 2380
1037 251 2381
173 14 2382
221 239 2383
172 495 2384
2157 1665 2385
175 2047 2386
226 1973 2387
164 1955 2388
1087 187 2389
1081 169 2390
178 369 2391
206 2379 2392
185 282 2393
795 176 2394
268 181 2395
157 187 2396
9 378 2397
290 31 2398
1078 2090 2399
166 13 2400
353 183 2401
28 260 2402
20 21 2403
939 284 2404
688 10 2405
370 667 2406
605 239 2407
593 314 2408
546 10 2409
246 492 2410
334 11 2411
310 171 2412
293 24 2413
211 282 2414
379 173 2415
426 202 2416
565 300 2417
186 199 2418
205 19 2419
318 19 2420
25 196 2421
1327 306 2422
404 670 2423
271 451 2424
255 214 2425
28 369 2426
236 403 2427
23 24 2428
194 660 2429
221 9 2430
450 6 2431
241 32 2432
304 22 2433
601 26 2434
163 311 2435
1541 35 2436
163 261 2437
299 7 2438
174 973 2439
955 844 2440
15 750 2441
512 303 2442
506 24 2443
426 329 2444
158 387 2445
255 231 2446
1720 172 2447
187 208 2448
568 317 2449
273 10 2450
251 27 2451
193 17 2452
658 24 2453
278 161 2454
898 478 2455
165 728 2456
543 632 2457
411 202 2458
168 303 2459
184 167 2460
780 7 2461
204 186 2462
2295 2153 2463
951 205 2464
1521 33 2465
310 18 2466
654 361 2467
643 183 2468
608 22 2469
272 172 2470
205 24 2471
284 30 2472
237 12 2473
25 282 2474
162 183 2475
20 260 2476
915 214 2477
11 181 2478
168 159 2479
602 32 2480
1584 33 2481
820 173 2482
28 779 2483
686 248 2484
158 267 2485
859 161 2486
190 165 2487
364 18 2488
537 10 2489
249 10 2490
460 2248 2491
715 165 2492
651 185 2493
791 384 2494
179 627 2495
178 309 2496
242 24 2497
188 49 2498
10 721 2499
456 12 2500
1775 182 2501
180 1336 2502
28 566 2503
311 340 2504
176 9 2505
242 19 2506
349 200 2507
166 519 2508
425 332 2509
203 10 2510
166 340 2511
243 8 2512
2001 173 2513
1460 873 2514
1267 170 2515
315 161 2516
263 738 2517
619 183 2518
434 24 2519
164 258 2520
908 17 2521
9 369 2522
671 280 2523
170 24 2524
265 205 2525
223 7 2526
157 218 2527
1499 1451 2528
252 878 2529
164 613 2530
608 30 2531
439 8 2532
354 19 2533
180 314 2534
164 288 2535
859 234 2536
195 14 2537
458 306 2538
803 332 2539
2023 240 2540
168 173 2541
357 162 2542
269 208 2543
1465 1719 2544
184 1398 2545
243 1144 2546
1032 176 2547
11 963 2548
931 17 2549
243 701 2550
643 440 2551
535 313 2552
245 270 2553
1011 30 2554
28 427 2555
166 892 2556
356 24 2557
557 7 2558
11 615 2559
489 196 2560
195 16 2561
387 12 2562
253 1620 2563
1615 388 2564
461 1262 2565
34 1225 2566
370 1113 2567
197 810 2568
603 24 2569
226 387 2570
386 11 2571
198 335 2572
168 322 2573
249 202 2574
220 19 2575
284 170 2576
1410 191 2577
216 169 2578
1466 2548 2579
16 212 2580
35 207 2581
193 10 2582
596 10 2583
489 299 2584
480 217 2585
420 24 2586
249 172 2587
162 8 2588
175 1683 2589
1651 501 2590
219 15 2591
279 33 2592
14 949 2593
751 34 2594
655 11 2595
544 19 2596
197 296 2597
489 280 2598
1617 10 2599
171 15 2600
249 7 2601
323 33 2602
31 2376 2603
252 17 2604
272 22 2605
863 196 2606
1038 33 2607
931 33 2608
828 322 2609
244 295 2610
581 242 2611
874 2603 2612
10 172 2613
910 344 2614
159 340 2615
388 651 2616
292 205 2617
2212 26 2618
302 18 2619
15 286 2620
168 1689 2621
348 162 2622
1257 213 2623
175 1077 2624
983 391 2625
584 856 2626
263 836 2627
283 523 2628
227 464 2629
175 330 2630
194 285 2631
36 282 2632
28 378 2633
705 280 2634
529 188 2635
167 24 2636
30 16 2637
2214 1123 2638
232 2039 2639
290 299 2640
158 1765 2641
302 5 2642
1574 12 2643
1118 282 2644
1106 219 2645
1076 889 2646
168 829 2647
394 692 2648
555 476 2649
524 24 2650
252 460 2651
265 451 2652
290 12 2653
331 195 2654
1191 361 2655
204 181 2656
183 507 2657
231 19 2658
218 335 2659
168 2312 2660
264 288 2661
245 27 2662
168 27 2663
1650 2029 2664
170 161 2665
163 412 2666
36 341 2667
158 309 2668
155 213 2669
436 208 2670
203 13 2671
203 272 2672
246 8 2673
221 503 2674
203 258 2675
9 431 2676
192 258 2677
1138 1071 2678
674 982 2679
263 919 2680
880 30 2681
638 24 2682
156 603 2683
228 545 2684
357 410 2685
348 395 2686
168 299 2687
209 39 2688
22 33 2689
256 19 2690
15 181 2691
211 2262 2692
212 171 2693
217 33 2694
404 13 2695
364 811 2696
635 24 2697
321 525 2698
232 501 2699
456 176 2700
198 405 2701
165 340 2702
296 12 2703
165 301 2704
32 161 2705
5 205 2706
276 7 2707
261 19 2708
236 15 2709
187 33 2710
2415 1685 2711
2372 329 2712
1053 195 2713
256 24 2714
277 9 2715
332 22 2716
1247 2108 2717
253 12 2718
157 1354 2719
13 1065 2720
334 1061 2721
746 7 2722
157 455 2723
287 187 2724
210 24 2725
194 342 2726
881 261 2727
187 28 2728
277 15 2729
47 6 2730
1289 546 2731
726 19 2732
702 24 2733
192 171 2734
268 5 2735
9 224 2736
1645 1304 2737
252 10 2738
162 296 2739
159 15 2740
462 7 2741
218 173 2742
15 161 2743
20 248 2744
158 219 2745
232 27 2746
2246 218 2747
157 2129 2748
254 1947 2749
1308 11 2750
1148 198 2751
908 33 2752
289 577 2753
547 166 2754
273 429 2755
279 405 2756
323 19 2757
347 12 2758
28 615 2759
194 12 2760
287 217 2761
242 188 2762
203 200 2763
1460 2456 2764
218 285 2765
17 191 2766
430 18 2767
31 376 2768
1732 288 2769
252 1556 2770
181 258 2771
252 801 2772
269 586 2773
211 501 2774
490 19 2775
228 181 2776
259 166 2777
394 251 2778
220 170 2779
622 169 2780
16 260 2781
172 342 2782
28 483 2783
383 17 2784
334 28 2785
193 26 2786
1601 1139 2787
275 11 2788
688 1103 2789
163 848 2790
4 275 2791
437 293 2792
1384 2612 2793
1404 13 2794
306 7 2795
283 13 2796
318 208 2797
263 199 2798
537 190 2799
970 9 2800
438 12 2801
168 171 2802
1827 300 2803
222 1470 2804
245 1128 2805
430 5 2806
944 176 2807
222 738 2808
710 332 2809
175 577 2810
530 30 2811
223 497 2812
329 344 2813
316 285 2814
287 167 2815
268 258 2816
4 97 2817
1393 191 2818
181 10 2819
47 2771 2820
202 25 2821
294 188 2822
159 463 2823
656 19 2824
190 186 2825
513 12 2826
834 20 2827
1891 2470 2828
192 215 2829
365 19 2830
399 2356 2831
22 208 2832
181 507 2833
315 166 2834
1517 1653 2835
237 26 2836
221 258 2837
246 7 2838
1145 317 2839
847 14 2840
357 485 2841
421 239 2842
416 19 2843
562 12 2844
9 427 2845
196 604 2846
472 13 2847
232 293 2848
586 2370 2849
214 335 2850
2139 1061 2851
425 344 2852
1956 1663 2853
1928 964 2854
203 173 2855
1661 330 2856
177 167 2857
843 922 2858
718 250 2859
348 585 2860
582 33 2861
373 447 2862
225 376 2863
237 19 2864
1940 169 2865
442 171 2866
1011 7 2867
402 9 2868
642 13 2869
214 24 2870
421 217 2871
304 1530 2872
251 1330 2873
1328 366 2874
178 1101 2875
311 14 2876
936 369 2877
854 19 2878
164 725 2879
416 24 2880
213 188 2881
199 280 2882
253 19 2883
425 13 2884
197 190 2885
243 13 2886
186 30 2887
703 2179 2888
1990 201 2889
480 200 2890
1424 13 2891
1259 409 2892
1187 11 2893
399 526 2894
189 400 2895
92 24 2896
334 166 2897
155 234 2898
403 34 2899
9 485 2900
157 207 2901
9 199 2902
180 250 2903
262 13 2904
435 300 2905
166 301 2906
674 182 2907
344 22 2908
190 1893 2909
172 1470 2910
418 14 2911
252 1387 2912
1238 231 2913
896 11 2914
271 721 2915
579 553 2916
524 19 2917
203 303 2918
1714 2909 2919
241 173 2920
517 17 2921
535 365 2922
168 162 2923
294 10 2924
242 330 2925
175 239 2926
1186 1481 2927
1434 202 2928
209 849 2929
348 709 2930
310 699 2931
180 631 2932
584 296 2933
241 533 2934
2933 38 2935
467 16 2936
453 37 2937
222 344 2938
168 312 2939
181 213 2940
608 8 2941
214 231 2942
780 6 2943
11 199 2944
375 19 2945
233 2712 2946
1094 2451 2947
30 202 2948
38 484 2949
241 242 2950
411 8 2951
166 7 2952
289 15 2953
1125 522 2954
945 618 2955
820 7 2956
783 24 2957
197 739 2958
348 717 2959
696 11 2960
163 644 2961
630 11 2962
456 20 2963
703 190 2964
1078 297 2965
1099 306 2966
12 161 2967
2866 1210 2968
599 11 2969
1375 420 2970
229 11 2971
168 166 2972
242 192 2973
558 6 2974
2424 33 2975
30 613 2976
34 43 2977
1027 1742 2978
1169 1605 2979
1488 937 2980
1396 161 2981
244 1071 2982
194 1050 2983
475 1042 2984
273 874 2985
203 781 2986
237 578 2987
302 297 2988
170 14 2989
215 187 2990
173 24 2991
329 11 2992
7 43 2993
210 176 2994
159 515 2995
252 13 2996
183 14 2997
27 19 2998
166 338 2999
203 297 3000
194 730 3001
216 2491 3002
310 8 3003
359 293 3004
200 366 3005
158 2345 3006
194 408 3007
608 7 3008
1412 1811 3009
333 1670 3010
193 1385 3011
155 1197 3012
240 711 3013
155 980 3014
854 24 3015
832 723 3016
832 161 3017
462 811 3018
594 19 3019
487 21 3020
429 24 3021
393 24 3022
173 183 3023
1021 191 3024
331 12 3025
323 17 3026
244 2645 3027
16 162 3028
180 208 3029
228 1547 3030
1436 720 3031
178 1346 3032
1026 201 3033
289 940 3034
703 377 3035
655 16 3036
619 195 3037
472 413 3038
426 262 3039
336 24 3040
241 318 3041
225 218 3042
184 192 3043
9 38 3044
359 31 3045
9 391 3046
253 30 3047
27 24 3048
16 218 3049
337 208 3050
10 169 3051
27 195 3052
2405 2562 3053
265 167 3054
21 19 3055
208 171 3056
464 24 3057
264 11 3058
628 1647 3059
193 1625 3060
399 1560 3061
193 1450 3062
1352 13 3063
1295 17 3064
1087 314 3065
1038 7 3066
834 742 3067
608 492 3068
429 19 3069
393 273 3070
211 341 3071
203 212 3072
197 182 3073
425 170 3074
746 30 3075
705 356 3076
16 234 3077
512 235 3078
47 5 3079
221 30 3080
2693 2703 3081
1126 3081 3082
991 8 3083
402 3082 3084
20 230 3085
289 30 3086
390 19 3087
253 17 3088
237 1220 3089
243 1183 3090
16 1176 3091
1076 360 3092
681 792 3093
746 33 3094
487 743 3095
245 686 3096
595 303 3097
298 523 3098
193 514 3099
263 30 3100
157 262 3101
243 250 3102
81 224 3103
22 3103 3104
268 33 3105
28 493 3106
311 15 3107
2197 192 3108
552 162 3109
241 16 3110
193 242 3111
200 39 3112
191 10 3113
266 38 3114
165 288 3115
2440 172 3116
9 407 3117
487 171 3118
241 2106 3119
1915 314 3120
1121 212 3121
1054 773 3122
1005 286 3123
581 418 3124
193 387 3125
198 341 3126
311 301 3127
84 78 3128
619 297 3129
186 188 3130
659 14 3131
429 30 3132
231 24 3133
197 181 3134
161 22 3135
895 219 3136
212 9 3137
16 385 3138
170 205 3139
741 200 3140
421 208 3141
168 278 3142
674 171 3143
276 19 3144
551 19 3145
17 247 3146
217 12 3147
1213 1560 3148
556 1444 3149
979 185 3150
891 182 3151
268 532 3152
372 531 3153
528 385 3154
198 481 3155
27 256 3156
212 725 3157
315 205 3158
17 590 3159
402 3091 3160
172 9 3161
287 176 3162
227 9 3163
402 212 3164
203 171 3165
2717 19 3166
283 26 3167
182 361 3168
7 215 3169
446 2360 3170
2210 476 3171
156 167 3172
1466 1530 3173
254 1314 3174
915 588 3175
168 878 3176
845 391 3177
180 725 3178
657 219 3179
237 621 3180
426 403 3181
401 212 3182
4 88 3183
36 486 3184
237 261 3185
196 10 3186
1922 176 3187
283 172 3188
247 242 3189
372 2849 3190
2840 626 3191
243 26 3192
347 11 3193
313 19 3194
272 19 3195
1175 10 3196
896 176 3197
174 161 3198
74 699 3199
348 542 3200
368 24 3201
327 18 3202
259 24 3203
192 11 3204
17 43 3205
225 7 3206
458 22 3207
172 39 3208
186 775 3209
431 24 3210
176 15 3211
2915 1540 3212
21 34 3213
184 8 3214
2589 1363 3215
873 2538 3216
250 9 3217
500 3216 3218
722 13 3219
461 2112 3220
245 1963 3221
176 33 3222
1533 303 3223
1295 30 3224
1235 307 3225
1208 851 3226
316 823 3227
798 19 3228
610 19 3229
270 474 3230
216 159 3231
179 21 3232
393 19 3233
1019 10 3234
1463 365 3235
1912 165 3236
9 159 3237
3104 38 3238
1192 194 3239
356 507 3240
10 15 3241
168 33 3242
270 188 3243
272 24 3244
249 18 3245
550 219 3246
211 2223 3247
1921 742 3248
350 1735 3249
1699 16 3250
1546 190 3251
1430 166 3252
1211 10 3253
1159 573 3254
843 1084 3255
302 801 3256
11 161 3257
180 205 3258
319 18 3259
166 217 3260
14 1642 3261
186 418 3262
199 360 3263
164 215 3264
1347 188 3265
375 162 3266
226 2706 3267
357 185 3268
444 2499 3269
168 8 3270
34 39 3271
237 251 3272
2020 559 3273
158 240 3274
283 1689 3275
1688 1088 3276
1636 162 3277
584 960 3278
268 947 3279
903 15 3280
315 838 3281
203 787 3282
673 295 3283
243 664 3284
241 634 3285
35 400 3286
417 210 3287
176 22 3288
237 200 3289
166 173 3290
212 16 3291
172 43 3292
277 31 3293
168 2873 3294
212 188 3295
168 200 3296
216 26 3297
28 585 3298
14 181 3299
354 361 3300
241 26 3301
1183 15 3302
394 31 3303
240 181 3304
822 11 3305
269 26 3306
628 1540 3307
1533 573 3308
194 1324 3309
1115 961 3310
941 457 3311
193 533 3312
170 492 3313
419 19 3314
411 205 3315
323 24 3316
193 257 3317
1432 34 3318
49 69 3319
902 169 3320
662 188 3321
239 829 3322
186 11 3323
252 26 3324
1809 721 3325
560 1525 3326
1401 1484 3327
1284 24 3328
1256 19 3329
180 1220 3330
419 1167 3331
1068 28 3332
475 974 3333
955 192 3334
230 33 3335
180 878 3336
28 838 3337
168 609 3338
453 41 3339
302 181 3340
1783 162 3341
165 343 3342
428 176 3343
228 200 3344
3211 81 3345
338 3345 3346
272 188 3347
266 3346 3348
438 253 3349
7 335 3350
1780 2780 3351
1054 14 3352
28 592 3353
203 1920 3354
1528 11 3355
28 712 3356
222 640 3357
466 43 3358
453 40 3359
327 22 3360
163 20 3361
796 27 3362
257 15 3363
28 431 3364
175 212 3365
42 42 3366
418 329 3367
203 33 3368
1404 459 3369
2875 7 3370
20 280 3371
242 30 3372
394 32 3373
1462 2483 3374
863 198 3375
1035 2180 3376
394 250 3377
1337 2083 3378
2022 634 3379
226 9 3380
186 207 3381
170 247 3382
1491 11 3383
1264 505 3384
168 1154 3385
1025 176 3386
381 882 3387
830 181 3388
783 19 3389
665 275 3390
530 311 3391
252 388 3392
221 330 3393
266 19 3394
244 256 3395
2052 213 3396
806 16 3397
1081 162 3398
2386 253 3399
225 195 3400
168 10 3401
17 397 3402
439 31 3403
3114 2371 3404
36 248 3405
20 19 3406
243 192 3407
270 10 3408
168 257 3409
34 507 3410
2624 212 3411
315 169 3412
164 25 3413
276 24 3414
168 293 3415
187 1080 3416
2063 1147 3417
304 11 3418
180 1659 3419
1628 1251 3420
35 161 3421
228 1260 3422
175 1147 3423
796 26 3424
164 405 3425
219 335 3426
158 218 3427
224 208 3428
432 758 3429
239 17 3430
272 176 3431
28 186 3432
317 188 3433
500 196 3434
168 2940 3435
197 13 3436
28 542 3437
2550 1100 3438
357 408 3439
193 293 3440
2071 190 3441
5 1958 3442
168 1949 3443
1756 6 3444
364 7 3445
203 1469 3446
308 24 3447
494 1198 3448
5 1181 3449
968 19 3450
163 874 3451
252 552 3452
406 549 3453
465 19 3454
455 19 3455
243 22 3456
225 167 3457
174 181 3458
251 656 3459
1654 9 3460
303 24 3461
333 11 3462
233 8 3463
3090 823 3464
25 161 3465
1509 459 3466
3003 942 3467
155 205 3468
3467 2268 3469
705 16 3470
20 181 3471
313 24 3472
2329 200 3473
2311 712 3474
180 691 3475
673 1903 3476
333 202 3477
168 1487 3478
180 840 3479
608 811 3480
35 566 3481
302 451 3482
411 183 3483
401 360 3484
292 19 3485
204 256 3486
532 182 3487
503 7 3488
175 1339 3489
192 181 3490
15 234 3491
450 169 3492
304 30 3493
866 172 3494
570 207 3495
229 181 3496
175 3166 3497
3160 1332 3498
14 840 3499
243 288 3500
454 378 3501
20 24 3502
2444 5 3503
2303 1109 3504
1927 335 3505
920 15 3506
228 1534 3507
1277 183 3508
168 1144 3509
605 1049 3510
1020 250 3511
263 933 3512
349 825 3513
789 679 3514
616 378 3515
582 208 3516
488 307 3517
246 457 3518
373 19 3519
359 191 3520
311 286 3521
27 3521 3522
159 7 3523
620 296 3524
1331 536 3525
242 13 3526
359 183 3527
33 356 3528
168 231 3529
591 8 3530
17 282 3531
265 171 3532
213 10 3533
166 544 3534
182 30 3535
845 2925 3536
308 10 3537
28 549 3538
1190 186 3539
32 483 3540
835 2335 3541
438 171 3542
252 258 3543
163 1400 3544
1352 815 3545
1255 836 3546
915 1113 3547
656 24 3548
241 631 3549
487 618 3550
233 309 3551
204 231 3552
1390 13 3553
218 274 3554
426 176 3555
750 18 3556
1221 172 3557
412 270 3558
33 196 3559
373 188 3560
347 188 3561
1854 200 3562
25 341 3563
695 3070 3564
193 20 3565
349 2985 3566
242 441 3567
953 188 3568
10 260 3569
27 183 3570
469 256 3571
2330 282 3572
36 207 3573
211 33 3574
166 19 3575
197 1996 3576
1402 11 3577
1175 17 3578
845 485 3579
705 666 3580
174 590 3581
226 532 3582
168 455 3583
538 215 3584
194 587 3585
18 24 3586
432 648 3587
159 182 3588
12 38 3589
553 19 3590
197 464 3591
427 24 3592
1164 187 3593
528 196 3594
351 420 3595
166 463 3596
202 27 3597
551 24 3598
332 30 3599
381 8 3600
1550 11 3601
1334 11 3602
1028 938 3603
968 24 3604
193 918 3605
266 823 3606
798 24 3607
193 545 3608
249 499 3609
401 318 3610
684 9 3611
3606 3589 3612
20 286 3613
13 161 3614
165 515 3615
250 11 3616
1985 162 3617
181 22 3618
349 219 3619
253 31 3620
3092 30 3621
3059 13 3622
1594 251 3623
1059 42 3624
238 192 3625
168 2128 3626
192 13 3627
2072 26 3628
2007 558 3629
168 1832 3630
1769 626 3631
168 553 3632
939 1516 3633
435 1243 3634
249 1234 3635
920 1223 3636
290 13 3637
682 664 3638
584 172 3639
558 7 3640
508 17 3641
406 483 3642
475 24 3643
227 383 3644
291 365 3645
520 47 3646
520 11 3647
169 367 3648
17 39 3649
169 378 3650
155 161 3651
25 256 3652
547 27 3653
27 231 3654
180 8 3655
229 202 3656
439 409 3657
3089 208 3658
157 186 3659
390 24 3660
1446 2478 3661
379 2441 3662
2432 729 3663
1041 559 3664
1927 285 3665
4 161 3666
289 1706 3667
158 1657 3668
1326 31 3669
1307 24 3670
562 1048 3671
204 999 3672
820 30 3673
693 201 3674
688 188 3675
241 644 3676
616 367 3677
241 523 3678
243 418 3679
396 19 3680
252 313 3681
226 307 3682
179 297 3683
255 202 3684
872 239 3685
11 39 3686
265 3629 3687
247 19 3688
168 205 3689
7 515 3690
229 231 3691
163 239 3692
233 195 3693
9 200 3694
210 420 3695
504 192 3696
212 176 3697
185 6 3698
295 219 3699
270 208 3700
540 6 3701
203 2593 3702
174 2537 3703
2513 224 3704
193 2454 3705
156 2351 3706
2319 274 3707
605 183 3708
203 12 3709
1782 270 3710
1598 432 3711
1471 264 3712
1326 299 3713
1291 332 3714
1239 161 3715
1145 261 3716
1027 295 3717
203 753 3718
170 712 3719
404 264 3720
252 393 3721
209 27 3722
562 182 3723
436 656 3724
249 183 3725
353 25 3726
695 658 3727
1110 294 3728
32 240 3729
1740 183 3730
176 360 3731
396 3157 3732
606 15 3733
426 224 3734
245 173 3735
1768 280 3736
202 170 3737
2377 332 3738
2206 1139 3739
1335 1934 3740
1769 925 3741
251 15 3742
1644 19 3743
349 1419 3744
1199 307 3745
298 1149 3746
26 1133 3747
990 764 3748
432 779 3749
241 639 3750
508 548 3751
16 497 3752
255 451 3753
411 182 3754
241 313 3755
302 24 3756
184 260 3757
175 200 3758
71 77 3759
82 82 3760
376 507 3761
1804 217 3762
47 192 3763
315 603 3764
194 869 3765
244 195 3766
524 188 3767
1509 13 3768
1008 702 3769
1564 403 3770
760 173 3771
38 20 3772
13 311 3773
1042 229 3774
887 367 3775
2570 1487 3776
2457 30 3777
2293 448 3778
1847 14 3779
835 1844 3780
275 208 3781
1716 24 3782
461 1659 3783
623 323 3784
254 5 3785
1550 1487 3786
308 19 3787
163 1298 3788
903 343 3789
618 24 3790
551 30 3791
517 9 3792
302 455 3793
417 212 3794
266 405 3795
305 212 3796
204 286 3797
719 393 3798
1002 33 3799
194 410 3800
241 13 3801
231 12 3802
239 183 3803
165 398 3804
1316 503 3805
599 7 3806
356 19 3807
253 15 3808
183 15 3809
197 10 3810
32 262 3811
1328 188 3812
248 282 3813
243 294 3814
1343 2908 3815
237 196 3816
375 24 3817
163 2475 3818
2357 358 3819
2135 161 3820
228 165 3821
2071 1918 3822
319 1596 3823
237 1510 3824
246 1237 3825
1223 447 3826
223 1197 3827
1163 16 3828
1102 19 3829
193 1049 3830
942 648 3831
168 3831 3832
42 821 3833
453 48 3834
417 31 3835
351 367 3836
346 22 3837
243 314 3838
241 311 3839
283 256 3840
155 231 3841
244 182 3842
911 247 3843
1124 26 3844
224 188 3845
25 182 3846
203 347 3847
769 185 3848
703 166 3849
2368 242 3850
227 219 3851
254 212 3852
200 185 3853
250 19 3854
235 16 3855
505 24 3856
267 26 3857
261 188 3858
13 471 3859
215 181 3860
1283 20 3861
164 273 3862
269 2753 3863
2745 190 3864
2737 165 3865
2728 672 3866
2514 566 3867
2409 679 3868
2289 251 3869
228 1865 3870
252 1818 3871
1619 293 3872
1589 11 3873
157 1394 3874
426 1314 3875
238 1167 3876
263 1065 3877
696 190 3878
535 39 3879
307 377 3880
178 374 3881
372 322 3882
450 18 3883
770 11 3884
447 17 3885
266 187 3886
172 534 3887
1434 190 3888
168 239 3889
181 26 3890
159 12 3891
2687 27 3892
238 171 3893
195 270 3894
173 12 3895
214 190 3896
277 3522 3897
1745 3514 3898
871 183 3899
1448 260 3900
213 176 3901
155 185 3902
3196 2264 3903
3120 459 3904
71 78 3905
11 712 3906
2770 2616 3907
333 307 3908
969 2677 3909
674 12 3910
168 2316 3911
1667 217 3912
1189 385 3913
302 1137 3914
1051 47 3915
392 988 3916
579 938 3917
222 919 3918
835 918 3919
222 836 3920
715 167 3921
351 493 3922
379 262 3923
194 335 3924
302 19 3925
4 105 3926
871 7 3927
14 2076 3928
2651 192 3929
2652 3894 3930
42 18 3931
225 161 3932
277 3772 3933
304 8 3934
26 176 3935
530 10 3936
241 162 3937
531 24 3938
215 274 3939
1998 3230 3940
178 3189 3941
28 536 3942
1076 219 3943
1700 13 3944
252 2758 3945
780 8 3946
233 7 3947
2412 1293 3948
800 165 3949
9 234 3950
2058 1261 3951
1820 191 3952
1764 19 3953
348 15 3954
747 1547 3955
230 17 3956
1110 1422 3957
1411 24 3958
245 1321 3959
1121 1258 3960
1131 858 3961
885 1073 3962
222 1065 3963
177 1062 3964
245 981 3965
872 235 3966
845 764 3967
605 187 3968
156 486 3969
453 51 3970
336 30 3971
270 182 3972
206 207 3973
4 107 3974
502 248 3975
283 235 3976
489 356 3977
446 257 3978
186 758 3979
204 207 3980
827 362 3981
73 78 3982
25 187 3983
47 172 3984
43 69 3985
319 3449 3986
404 194 3987
203 20 3988
203 8 3989
703 3238 3990
196 422 3991
245 217 3992
248 342 3993
32 549 3994
159 11 3995
16 672 3996
158 2654 3997
228 171 3998
283 32 3999
77 75 4000
2490 376 4001
167 23 4002
2300 161 4003
180 782 4004
2243 162 4005
2215 841 4006
599 2194 4007
2192 395 4008
2167 294 4009
2115 358 4010
835 2060 4011
203 293 4012
349 1865 4013
1749 13 4014
1612 457 4015
180 1542 4016
1448 161 4017
1430 1062 4018
203 1372 4019
1319 544 4020
249 1246 4021
1178 613 4022
504 1084 4023
1014 19 4024
1002 8 4025
850 24 4026
756 473 4027
671 588 4028
630 476 4029
508 588 4030
582 495 4031
32 566 4032
165 463 4033
175 318 4034
219 285 4035
281 24 4036
203 22 4037
557 17 4038
599 34 4039
182 19 4040
28 794 4041
3582 181 4042
193 33 4043
7 463 4044
166 15 4045
277 3260 4046
199 285 4047
204 176 4048
3073 219 4049
193 183 4050
399 2948 4051
210 30 4052
437 170 4053
454 367 4054
1043 16 4055
1191 607 4056
228 2136 4057
1699 740 4058
312 19 4059
240 1431 4060
241 1210 4061
1000 24 4062
241 918 4063
177 882 4064
637 849 4065
699 792 4066
220 776 4067
665 11 4068
359 632 4069
574 470 4070
203 533 4071
437 297 4072
318 405 4073
394 301 4074
333 24 4075
197 332 4076
245 313 4077
158 312 4078
302 205 4079
4 231 4080
449 208 4081
1173 23 4082
2324 365 4083
698 337 4084
162 11 4085
187 43 4086
7 285 4087
28 390 4088
3930 171 4089
261 24 4090
595 194 4091
180 3880 4092
297 22 4093
166 9 4094
196 366 4095
1172 365 4096
296 34 4097
162 218 4098
168 14 4099
186 343 4100
14 385 4101
707 10 4102
168 202 4103
14 3459 4104
370 702 4105
1271 272 4106
12 260 4107
1324 30 4108
1207 188 4109
315 458 4110
3110 407 4111
15 247 4112
304 299 4113
2621 285 4114
2125 708 4115
1741 217 4116
32 234 4117
500 1355 4118
579 1280 4119
608 1237 4120
1000 19 4121
990 391 4122
222 933 4123
905 201 4124
609 900 4125
893 217 4126
328 860 4127
827 551 4128
246 811 4129
203 792 4130
517 343 4131
426 309 4132
354 300 4133
327 21 4134
316 12 4135
86 85 4136
216 185 4137
265 194 4138
